---
kind: property
id: P:Autodesk.Revit.DB.PolylineSegments.LineProperties
source: html/cd0e1765-5e62-96e6-a807-4267e0f7db30.htm
---
# Autodesk.Revit.DB.PolylineSegments.LineProperties Property

Access to the line (pen) properties of the polyline

## Syntax (C#)
```csharp
public LineProperties LineProperties { get; }
```